nxp-mcuxpresso/mcux-sdk-examples/evkmimxrt1180/driver_examples/netc/txrx_transfer/cm33/pin_mux.h
/*
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);                    /* Function assigned for the Cortex-M33 */

/* GPIO_AD_25 (coord M15), PHY0_RESET */
/* Routed pin properties */
#define BOARD_INITPHYACCESSPINS_PHY0_RESET_PERIPHERAL                     RGPIO4   /*!< Peripheral name */
#define BOARD_INITPHYACCESSPINS_PHY0_RESET_SIGNAL                        gpio_io   /*!< Signal name */
#define BOARD_INITPHYACCESSPINS_PHY0_RESET_CHANNEL                           25U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPHYACCESSPINS_PHY0_RESET_GPIO                           RGPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITPHYACCESSPINS_PHY0_RESET_GPIO_PIN                          25U   /*!< GPIO pin number */
#define BOARD_INITPHYACCESSPINS_PHY0_RESET_GPIO_PIN_MASK             (1U << 25U)   /*!< GPIO pin mask */

/* GPIO_B1_13 (coord B11), PHY1_RESET */
/* Routed pin properties */
#define BOARD_INITPHYACCESSPINS_PHY1_RESET_PERIPHERAL                     RGPIO6   /*!< Peripheral name */
#define BOARD_INITPHYACCESSPINS_PHY1_RESET_SIGNAL                        gpio_io   /*!< Signal name */
#define BOARD_INITPHYACCESSPINS_PHY1_RESET_CHANNEL                           13U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPHYACCESSPINS_PHY1_RESET_GPIO                           RGPIO6   /*!< GPIO peripheral base pointer */
#define BOARD_INITPHYACCESSPINS_PHY1_RESET_GPIO_PIN                          13U   /*!< GPIO pin number */
#define BOARD_INITPHYACCESSPINS_PHY1_RESET_GPIO_PIN_MASK             (1U << 13U)   /*!< GPIO pin mask */

/* GPIO_AD_28 (coord L16), PHY2_RESET */
/* Routed pin properties */
#define BOARD_INITPHYACCESSPINS_PHY2_RESET_PERIPHERAL                     RGPIO4   /*!< Peripheral name */
#define BOARD_INITPHYACCESSPINS_PHY2_RESET_SIGNAL                        gpio_io   /*!< Signal name */
#define BOARD_INITPHYACCESSPINS_PHY2_RESET_CHANNEL                           28U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPHYACCESSPINS_PHY2_RESET_GPIO                           RGPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITPHYACCESSPINS_PHY2_RESET_GPIO_PIN                          28U   /*!< GPIO pin number */
#define BOARD_INITPHYACCESSPINS_PHY2_RESET_GPIO_PIN_MASK             (1U << 28U)   /*!< GPIO pin mask */

/* GPIO_B2_01 (coord E10), PHY3_RESET */
/* Routed pin properties */
#define BOARD_INITPHYACCESSPINS_PHY3_RESET_PERIPHERAL                     RGPIO6   /*!< Peripheral name */
#define BOARD_INITPHYACCESSPINS_PHY3_RESET_SIGNAL                        gpio_io   /*!< Signal name */
#define BOARD_INITPHYACCESSPINS_PHY3_RESET_CHANNEL                           15U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPHYACCESSPINS_PHY3_RESET_GPIO                           RGPIO6   /*!< GPIO peripheral base pointer */
#define BOARD_INITPHYACCESSPINS_PHY3_RESET_GPIO_PIN                          15U   /*!< GPIO pin number */
#define BOARD_INITPHYACCESSPINS_PHY3_RESET_GPIO_PIN_MASK             (1U << 15U)   /*!< GPIO pin mask */

/* GPIO_AD_13 (coord N15), PHY4_RESET */
/* Routed pin properties */
#define BOARD_INITPHYACCESSPINS_PHY4_RESET_PERIPHERAL                     RGPIO4   /*!< Peripheral name */
#define BOARD_INITPHYACCESSPINS_PHY4_RESET_SIGNAL                        gpio_io   /*!< Signal name */
#define BOARD_INITPHYACCESSPINS_PHY4_RESET_CHANNEL                           13U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPHYACCESSPINS_PHY4_RESET_GPIO                           RGPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITPHYACCESSPINS_PHY4_RESET_GPIO_PIN                          13U   /*!< GPIO pin number */
#define BOARD_INITPHYACCESSPINS_PHY4_RESET_GPIO_PIN_MASK             (1U << 13U)   /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPhyAccessPins(void);           /* Function assigned for the Cortex-M33 */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitEpPins(void);                  /* Function assigned for the Cortex-M33 */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSwtPort0Pins(void);            /* Function assigned for the Cortex-M33 */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSwtPort1Pins(void);            /* Function assigned for the Cortex-M33 */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSwtPort2Pins(void);            /* Function assigned for the Cortex-M33 */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSwtPort3Pins(void);            /* Function assigned for the Cortex-M33 */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
